---
kind: property
id: P:Autodesk.Revit.DB.TableCellCombinedParameterData.ParamId
source: html/c1eed84d-4eb2-6ee1-b181-4713c5ba2e60.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.ParamId Property

The parameter id

## Syntax (C#)
```csharp
public ElementId ParamId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null